In [1]:
import numpy as np
import pandas as pd
from datetime import datetime as dt, timedelta
import re

In [2]:
today = dt.now()
today = today.date()
days = pd.date_range(today, today + timedelta(364))

In [3]:
employees = ['bill','karen','horst']

In [4]:
tips = np.random.randint(1, high=100, size=len(days))

In [5]:
emps = {}
for i in employees:
    emps[i] = tips

In [6]:
df1 = pd.DataFrame(emps)

In [7]:
df = df1.set_index(days)

In [8]:
df.head()

            bill  karen  horst
2021-04-23    24     24     24
2021-04-24    87     87     87
2021-04-25    45     45     45
2021-04-26    30     30     30
2021-04-27     3      3      3

In [9]:
data = np.random.randint(1, high=100, size=len(days))
df = pd.DataFrame({'col2': data})
#df = df.set_index('test')
df.head()

   col2
0    36
1    42
2    37
3     7
4    35

In [10]:
df['employee'] = pd.cut(df['col2'],bins=len(employees),labels=employees)
df['date'] = days
df.head()

   col2 employee       date
0    36    karen 2021-04-23
1    42    karen 2021-04-24
2    37    karen 2021-04-25
3     7     bill 2021-04-26
4    35    karen 2021-04-27

In [11]:
df.head()

   col2 employee       date
0    36    karen 2021-04-23
1    42    karen 2021-04-24
2    37    karen 2021-04-25
3     7     bill 2021-04-26
4    35    karen 2021-04-27

In [12]:
#dt = df.groupby(['employee', pd.Grouper(key='date', freq='SM')])['col2'].sum().reset_index().sort_values('date')

In [63]:
start = pd.to_datetime('4/22/21').date()
start

datetime.date(2021, 4, 22)

In [14]:
biweek = pd.date_range(start, start + timedelta(13))

In [15]:
biweek

DatetimeIndex(['2021-04-22', '2021-04-23', '2021-04-24', '2021-04-25',
               '2021-04-26', '2021-04-27', '2021-04-28', '2021-04-29',
               '2021-04-30', '2021-05-01', '2021-05-02', '2021-05-03',
               '2021-05-04', '2021-05-05'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df1 = df.pivot_table('col2','employee','date')
df1.head()

date,2021-04-23,2021-04-24,2021-04-25,2021-04-26,2021-04-27,2021-04-28,2021-04-29,2021-04-30,2021-05-01,2021-05-02,...,2022-04-13,2022-04-14,2022-04-15,2022-04-16,2022-04-17,2022-04-18,2022-04-19,2022-04-20,2022-04-21,2022-04-22
employee,,,,,,,,,,,,,,,,,,,,,
bill,NaN,NaN,NaN,7.0,NaN,NaN,9.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,25.0,26.0,7.0,10.0,NaN,32.0
karen,36.0,42.0,37.0,NaN,35.0,35.0,NaN,NaN,35.0,NaN,...,NaN,57.0,65.0,56.0,NaN,NaN,NaN,NaN,34.0,NaN
horst,NaN,NaN,NaN,NaN,NaN,NaN,NaN,79.0,NaN,93.0,...,88.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
# df1 = df1[biweek]
# df1.head()

In [19]:
df1['gross'] = df1.sum(axis=1)
df1['claimed'] = df1['gross'] * .60
df1.head()

date,2021-04-23 00:00:00,2021-04-24 00:00:00,2021-04-25 00:00:00,2021-04-26 00:00:00,2021-04-27 00:00:00,2021-04-28 00:00:00,2021-04-29 00:00:00,2021-04-30 00:00:00,2021-05-01 00:00:00,2021-05-02 00:00:00,...,2022-04-15 00:00:00,2022-04-16 00:00:00,2022-04-17 00:00:00,2022-04-18 00:00:00,2022-04-19 00:00:00,2022-04-20 00:00:00,2022-04-21 00:00:00,2022-04-22 00:00:00,gross,claimed
employee,,,,,,,,,,,,,,,,,,,,,
bill,NaN,NaN,NaN,7.0,NaN,NaN,9.0,NaN,NaN,NaN,...,NaN,NaN,25.0,26.0,7.0,10.0,NaN,32.0,2481.0,1488.6
karen,36.0,42.0,37.0,NaN,35.0,35.0,NaN,NaN,35.0,NaN,...,65.0,56.0,NaN,NaN,NaN,NaN,34.0,NaN,6175.0,3705.0
horst,NaN,NaN,NaN,NaN,NaN,NaN,NaN,79.0,NaN,93.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9339.0,5603.4

In [20]:
df.head()

   col2 employee       date
0    36    karen 2021-04-23
1    42    karen 2021-04-24
2    37    karen 2021-04-25
3     7     bill 2021-04-26
4    35    karen 2021-04-27

In [21]:
df2 = df1[['gross','claimed']]

In [22]:
for k,v in df2.iterrows():
    print(k)
    print(v)

bill
date
gross      2481.0
claimed    1488.6
Name: bill, dtype: float64
karen
date
gross      6175.0
claimed    3705.0
Name: karen, dtype: float64
horst
date
gross      9339.0
claimed    5603.4
Name: horst, dtype: float64

In [ ]:
df = pd.read_csv('test - Marigny.csv')

In [ ]:
df.head()

In [25]:
cols = df.columns
df.drop(cols[0:6],axis=1,inplace=True)

In [26]:
df.drop('created_at',axis=1,inplace=True)

In [27]:
df['date'] = pd.to_datetime(df['date'])
df['tips'] = round(df.tips.astype(int))

In [ ]:
df

In [29]:
df = df.pivot_table('tips','name','date')

In [30]:
df.head()

date    2021-04-20  2021-04-23
name
Bill     26.857143       127.0
bloosh         NaN       127.0
joke           NaN       127.0

In [64]:
start = input('please enter a valid date')

please enter a valid date12/23/21

In [65]:
print(start)

12/23/21

In [66]:
patt = re.compile('\d{2}/\d{2}/\d{2}')

In [67]:
print(patt)

re.compile('\\d{2}/\\d{2}/\\d{2}')

In [68]:
re.findall(patt,start)

['12/23/21']

gucci

In [83]:
start = input('please enter a valid date')

please enter a valid date

In [ ]:
def check_date(s):

    patt = re.compile('\d{2}/\d{2}/\d{2}')


    if re.findall(patt,s) == []:
        print('you fucked up')
        return False
    else:
        print('gucci')
        try:
            start = pd.to_datetime(s).date()
            return start
            
        except:
            return False

In [ ]:
check_date(start)

In [ ]:
pay_period = pd.date_range(start, start + timedelta(2))

In [36]:
start = dt(int(year),int(month),int(day)).date()
biweek = pd.date_range(start, start + timedelta(13))

NameError: name 'year' is not defined

In [ ]:


df['day'] = df['date'].dt.day_name().astype(str)
df['day'] = df['day'].str.replace(r'(\w+day\b)',lambda x: x.groups()[0][:3])
df['Date'] =  df.date.astype(str) + '\n' + df.day + '\n' + df.time.astype(str)
df.fillna('-',inplace=True)
df = df.pivot_table(index="name",columns=["Date"],values="tips")

In [ ]:
dataframe['date'] = pd.to_datetime(dataframe['created_at']).dt.date

df = dataframe.pivot_table('tips','name','date')

df1 = df[biweek]

df1['gross'] = df1.sum(axis=1)
df1['claimed'] = df1['gross'] * .60